<?php
chdir(dirname(__DIR__));

// Setup autoloading
require 'init_autoloader.php';

setlocale( LC_ALL, 'ja_JP.UTF-8' );
ini_set( 'default_charset', 'UTF-8' );
mb_internal_encoding( 'UTF-8' );
mb_http_output('UTF-8');
mb_regex_encoding( 'UTF-8' );

ini_set( 'max_execution_time', 0 );


use Coral\Base\Application\BaseApplicationAbstract;
use Coral\Base\BaseLog;
use Zend\Db\Adapter\Adapter;
use Zend\Config\Reader\Ini;
use models\Table\TableUser;
use models\Logic\LogicCancel;
use models\Logic\OrderCancelException;


/**
 * アプリケーションクラスです。
 *
 */
class Application extends BaseApplicationAbstract {
    protected $_application_id = 'tools-CancelRegister-batch';

    /**
     * Application の唯一のインスタンスを取得します。
     *
     * @static
     * @access public
     * @return Application
     */
    public static function getInstance() {
        if( self::$_instance === null ) {
            self::$_instance = new self();
        }

        return self::$_instance;
    }

    /**
     * Application の新しいインスタンスを初期化します。
     *
     * @ignore
     * @access private
     */
    private function __construct() {
        parent::init();
    }

    /**
     * @var Adapter
     */
    public $dbAdapter;

    /**
     * @var BaseLog
     */
    public $logger;


    /**
     * アプリケーションを実行します。
     *
     * @access public
     */
    public function run() {
        $exitCode = 1;

        try {

            // 実行確認
            echo "Run the Cancel batch. Is it OK?(Y/N)";
            $yn = trim(fgets(STDIN));
            if (strtoupper($yn) != 'Y') {
                echo "It has stopped the execution. ";
                exit(0);
            }

            // iniファイルから設定を取得
            $configPath = __DIR__ . '/../module/cbadmin/config/config.ini';

            // データベースアダプタをiniファイルから初期化します
            $data = array();
            if (file_exists($configPath))
            {
                $reader = new Ini();
                $data = $reader->fromFile($configPath);
            }
            $this->dbAdapter = new Adapter($data['database']);

            // ログ設定の読み込み
            $logConfig = $data['log'];
            // 標準ログクラス初期化
            $this->logger = BaseLog::createFromArray( $logConfig );
$this->logger->info('_data_patch_20201009_1530_CancelRegister.php start');

            $globalConfig = include __DIR__ . '/../config/autoload/global.php';
            // 接続時間を設定する
            $rds_session_timezone = $globalConfig['RDS_SESSION_TIMEZONE'];
            if (isset($rds_session_timezone)) {
                $this->dbAdapter->query('SET SESSION time_zone = :time_zone')->execute(array(':time_zone'=>$rds_session_timezone));
            }

            // 設定をシステムプロパティテーブルから読み込み
            $apinfo = $this->getApplicationiInfo($this->dbAdapter, 'cbadmin');
            // iniファイルの内容をマージ
            $data = array_merge($data, $apinfo);

            // ユーザーID取得
            $mdlu = new TableUser($this->dbAdapter);
            $userId = $mdlu->getUserId(TableUser::USERCLASS_SYSTEM, TableUser::SEQ_BATCH_USER);

            $this->dbAdapter->getDriver()->getConnection()->beginTransaction();


            // ------------------------------------------------------------------------->
            // 対象の定義
            $target = array(
'AK47445268',
'AK47028635',
'AK47007115',
'AK46867341',
'AK47334380',
'AK47581319',
'AK47445588',
'AK47080511',
'AK47080520',
'AK47050827',
'AK46770964',
'AK47286561',
'AK47009812',
'AK46999168',
'AK46769921',
'AK46769610',
'AK47589562',
'AK47057966',
'AK47057983',
'AK47058062',
'AK47678414',
'AK47678417',
'AK47654416',
'AK47504911',
'AK47479218',
'AK47234821',
'AK47079953',
'AK46840986',
'AK47323437',
'AK47228661',
'AK47674813',
'AK47418194',
'AK47231996',
'AK47228496',
'AK46910110',
'AK46915330',
'AK47095591',
'AK47667810',
'AK47667867',
'AK47667882',
'AK47646080',
'AK47496377',
'AK47496419',
'AK47496430',
'AK47496628',
'AK47333292',
'AK47333355',
'AK47095524',
'AK47341302',
'AK47056578',
'AK45505953',
'AK47423120',
'AK47422683',
'AK46979409',
'AK45993490',
'AK47246172',
'AK47495706',
'AK47081699',
'AK47710585',
'AK47507246',
'AK47694479',
'AK47354467',
'AK47081730',
'AK47001307',
'AK47670572',
'AK47647675',
'AK47554734',
'AK47499632',
'AK47479927',
'AK47474780',
'AK47474804',
'AK47442501',
'AK47414636',
'AK47414651',
'AK47310975',
'AK47288467',
'AK47285766',
'AK47255392',
'AK47051818',
'AK47052488',
'AK47026308',
'AK47026298',
'AK47008433',
'AK47647889',
'AK47734180',
'AK47080930',
'AK47263485',
'AK47404239',
'AK46976163',
'AK47720772',
'AK47260490',
'AK47497828',
'AK47461489',
'AK47634511',
'AK46972607',
'AK46929646',
'AK46905255',
'AK47297186',
'AK47297168',
'AK47528264',
'AK47512146',
'AK47405779',
'AK47348520',
'AK47208563',
'AK47208552',
'AK47208430',
'AK47195146',
'AK47145607',
'AK46972697',
'AK46972803',
'AK46972600',
'AK46972373',
'AK46972326',
'AK46929913',
'AK47634444',
'AK47364098',
'AK47297041',
'AK47194706',
'AK46972269',
'AK46905289',
'AK46905207',
'AK47571580',
'AK47512024',
'AK47297318',
'AK47297305',
'AK47634563',
'AK47364007',
'AK46972673',
'AK47634310',
'AK47634361',
'AK47634385',
'AK47634402',
'AK47634424',
'AK47634430',
'AK47634446',
'AK47634482',
'AK47634493',
'AK47634494',
'AK47634499',
'AK47634528',
'AK47634533',
'AK47634549',
'AK47634558',
'AK47634566',
'AK47634581',
'AK47634591',
'AK47634669',
'AK47634685',
'AK47634698',
'AK47634743',
'AK47634753',
'AK47634762',
'AK47634773',
'AK47634788',
'AK47634799',
'AK47634827',
'AK47602254',
'AK47602258',
'AK47602261',
'AK47602267',
'AK47602268',
'AK47602270',
'AK47602275',
'AK47602278',
'AK47602285',
'AK47602286',
'AK47602287',
'AK47602290',
'AK47602297',
'AK47602299',
'AK47602303',
'AK47602308',
'AK47602313',
'AK47602316',
'AK47602317',
'AK47602318',
'AK47602324',
'AK47602300',
'AK47528090',
'AK47528116',
'AK47528119',
'AK47528131',
'AK47528138',
'AK47528141',
'AK47528142',
'AK47528143',
'AK47528146',
'AK47528170',
'AK47528209',
'AK47528260',
'AK47512041',
'AK47512071',
'AK47512094',
'AK47512135',
'AK47512138',
'AK47512215',
'AK47489856',
'AK47489857',
'AK47489860',
'AK47489861',
'AK47489862',
'AK47489865',
'AK47489866',
'AK47489869',
'AK47489870',
'AK47489872',
'AK47489875',
'AK47489879',
'AK47489881',
'AK47461122',
'AK47461126',
'AK47461190',
'AK47461219',
'AK47461274',
'AK47461311',
'AK47461464',
'AK47461510',
'AK47405767',
'AK47405769',
'AK47405777',
'AK47405782',
'AK47381056',
'AK47378009',
'AK47378030',
'AK47378070',
'AK47378127',
'AK47378185',
'AK47378252',
'AK47378262',
'AK47378275',
'AK47378278',
'AK47364103',
'AK47363980',
'AK47364014',
'AK47364020',
'AK47364028',
'AK47364046',
'AK47364058',
'AK47364091',
'AK47364092',
'AK47364126',
'AK47364127',
'AK47364259',
'AK47364263',
'AK47326791',
'AK47326797',
'AK47326798',
'AK47326801',
'AK47326805',
'AK47326811',
'AK47326812',
'AK47326813',
'AK47326815',
'AK47326817',
'AK47348290',
'AK47348319',
'AK47348365',
'AK47348389',
'AK47348391',
'AK47348407',
'AK47348436',
'AK47348452',
'AK47348457',
'AK47348506',
'AK47348562',
'AK47348595',
'AK47348608',
'AK47269817',
'AK47269822',
'AK47269825',
'AK47269827',
'AK47269831',
'AK47269834',
'AK47269837',
'AK47269842',
'AK47269844',
'AK47269847',
'AK47269848',
'AK47269852',
'AK47269854',
'AK47269857',
'AK47241589',
'AK47241591',
'AK47241599',
'AK47241618',
'AK47241643',
'AK47241670',
'AK47241672',
'AK47241676',
'AK47241685',
'AK47241709',
'AK47241726',
'AK47241729',
'AK47241737',
'AK47241744',
'AK47297050',
'AK47297073',
'AK47297076',
'AK47297089',
'AK47297102',
'AK47297107',
'AK47297110',
'AK47297138',
'AK47297141',
'AK47297143',
'AK47297155',
'AK47297172',
'AK47297176',
'AK47297179',
'AK47297180',
'AK47297182',
'AK47297190',
'AK47297227',
'AK47297263',
'AK47297280',
'AK47297287',
'AK47297396',
'AK47297397',
'AK47297423',
'AK47297429',
'AK47297436',
'AK47297456',
'AK47297465',
'AK47194726',
'AK47194728',
'AK47194731',
'AK47194740',
'AK47194750',
'AK47194751',
'AK47194758',
'AK47194762',
'AK47194766',
'AK47194773',
'AK47194816',
'AK47194838',
'AK47194842',
'AK47194908',
'AK47194910',
'AK47194920',
'AK47194928',
'AK47194929',
'AK47194975',
'AK47194978',
'AK47195009',
'AK47195014',
'AK47195059',
'AK47195080',
'AK47195137',
'AK47195141',
'AK47195153',
'AK47145820',
'AK47145613',
'AK47145619',
'AK47145626',
'AK47145663',
'AK47145728',
'AK47145777',
'AK47145790',
'AK47145846',
'AK47145919',
'AK47145824',
'AK47086103',
'AK47086111',
'AK47086134',
'AK47086136',
'AK47086148',
'AK47086171',
'AK46988321',
'AK46988322',
'AK46972361',
'AK46972494',
'AK46972787',
'AK46972791',
'AK46972385',
'AK46956999',
'AK46956750',
'AK46905137',
'AK46905151',
'AK46905185',
'AK46905195',
'AK47378174',
'AK47364188',
'AK46972308',
'AK46972556',
'AK46972511',
'AK46972186',
'AK46972233',
'AK46972243',
'AK46972263',
'AK46972277',
'AK46972288',
'AK46972300',
'AK46972335',
'AK46972337',
'AK46972363',
'AK46972365',
'AK46972384',
'AK46972390',
'AK46972402',
'AK46972418',
'AK46972421',
'AK46972425',
'AK46972433',
'AK46972438',
'AK46972465',
'AK46972479',
'AK46972509',
'AK46972514',
'AK46972515',
'AK46972517',
'AK46972534',
'AK46972562',
'AK46972565',
'AK46972585',
'AK46972586',
'AK46972588',
'AK46972590',
'AK46972593',
'AK46972609',
'AK46972647',
'AK46972651',
'AK46972652',
'AK46972682',
'AK46972683',
'AK46972690',
'AK46972699',
'AK46972704',
'AK46972711',
'AK46972719',
'AK46972734',
'AK46972758',
'AK46972769',
'AK46972774',
'AK46972777',
'AK46972786',
'AK46972790',
'AK46972808',
'AK46956844',
'AK46956857',
'AK46956861',
'AK46956870',
'AK46956880',
'AK46956916',
'AK46956953',
'AK46956954',
'AK46956975',
'AK46956994',
'AK46957004',
'AK46957006',
'AK46957009',
'AK46957023',
'AK46957025',
'AK46956799',
'AK46956829',
'AK46956788',
'AK46929693',
'AK46929698',
'AK46929732',
'AK46929738',
'AK46929790',
'AK46929864',
'AK46929872',
'AK46929886',
'AK46929903',
'AK46929915',
'AK46905328',
'AK46905191',
'AK46905125',
'AK46905145',
'AK46905199',
'AK46905204',
'AK46905215',
'AK46905244',
'AK46905248',
'AK46905258',
'AK46905284',
'AK46905285',
'AK46905298',
'AK46905305',
'AK46905220',
'AK47571597',
'AK47571624',
'AK47571640',
'AK47571666',
'AK47571670',
'AK47571672',
'AK47571675',
'AK47571681',
'AK47571704',
'AK47571717',
'AK47571719',
'AK47378050',
'AK46972391',
'AK47194699',
'AK46929739',
'AK46972662',
'AK46972706',
'AK46972735',
'AK47194785',
'AK47378244',
'AK47528066',
'AK47461320',
'AK47461165',
'AK47489858',
'AK46972444',
'AK47348438',
'AK47378061',
'AK47378067',
'AK47405784',
'AK47348387',
'AK47326796',
'AK47326804',
'AK47634764',
'AK47348354',
'AK46972591',
'AK46972210',
'AK46972546',
'AK47364106',
'AK46972350',
'AK47326800',
'AK46972723',
'AK47378178',
'AK46929920',
'AK47297188',
'AK46972611',
'AK47208553',
'AK47208565',
'AK47208601',
'AK47208616',
'AK47208626',
'AK47208629',
'AK47208679',
'AK47208710',
'AK47208432',
'AK47208469',
'AK47208481',
'AK47208497',
'AK47208513',
'AK47208522',
'AK47364037',
'AK47571695',
'AK47528276',
'AK47489876',
'AK47634811',
'AK47489874',
'AK47194969',
'AK47194770',
'AK47297060',
'AK46972708',
'AK47194991',
'AK47326789',
'AK47269811',
'AK46972188',
'AK47195166',
'AK47194977',
'AK46619933',
'AK47580761',
'AK46935579',
'AK46088025',
'AK46149592',
'AK47597426',
'AK47086472',
'AK47499669',
'AK46701255',
'AB47219020',
'AB47219180',
'AB47220390',
'AB47223611',
'AB47224621',
'AB47221571',
'AB47223081',
'AB47224202',
'AB47220242',
'AB47221752',
'AB47223382',
'AB47219803',
'AB47223943',
'AB47223483',
'AB47217734',
'AB47220454',
'AB47223364',
'AB47221674',
'AB47223974',
'AB47220884',
'AB47217194',
'AB47224625',
'AB47217435',
'AB47218545',
'AB47222865',
'AB47218275',
'AB47220875',
'AB47219595',
'AB47224746',
'AB47222946',
'AB47219946',
'AB47221156',
'AB47223656',
'AB47217186',
'AB47217247',
'AB47218257',
'AB47221657',
'AB47224567',
'AB47220667',
'AB47219077',
'AB47217177',
'AB47218287',
'AB47217268',
'AB47222939',
'AB47219259',
'AB47217679',
'AK47471608',
'AK47669238',
'AK47734515',
'AK47495652',
'AK47669210',
'AK47554264',
'AK47613053',
'AK47581483',
'AK47054047',
'AK47303430',
'AK47438454',
'AK47012900',
'AK46963826',
'AK47151096',
'AK47093095',
'AK47307013',
'AK47552881',
'AK47552923',
'AK47553157',
'AK47279303',
'AK47219345',
'AK46995294',
'AK46859332',
'AK46834963',
'AK47235004',
'AK47499347',
'AK46672627',
'AK46779191',
'AK47525592',
'AK47565166',
'AK47098678',
'AK47078458',
'AK47256693',
'AK47256038',
'AK47256067',
'AK47256094',
'AK47256097',
'AK47256938',
'AK46998720',
'AK47349144',
'AK47349134',
'AK47312252',
'AK47312285',
'AK47512985',
'AK47512987',
'AK47487092',
'AK47462001',
'AK47462007',
'AK47462010',
'AK47086928',
'AK46957842',
'AK46957843',
'AK46957850',
'AK46957858',
'AK46930397',
'AK46957083',
'AK47064193',
'AK47348497',
'AK47378368',
'AK47348492',
'AK47348489',
'AK47323343',
'AK47323345',
'AK47297498',
'AK47297499',
'AK47264783',
'AK47242003',
'AK47242005',
'AK47195046',
'AK47146295',
'AK47146297',
'AK47086375',
'AK47086376',
'AK47064192',
'AK47064204',
'AK47064196',
'AK46985823',
'AK46972614',
'AK46957082',
'AK47182589',
'AK47182587',
'AK46971910',
'AB47459518',
'AB47546024',
'AK47423687',
'AK46484806',
'AK46344570',
'AK47254791',
'AK47586301',
'AK46968359',
'AK47541775',
'AK47481337',
'AK47380862',
'AK47377003',
'AK47244284',
'AK46267273',
'AK46239536',
'AK46241064',
'AK46238021',
'AK46242074',
'AK47678804',
'AK47715176',
'AK47707856',
'AK47428080',
'AK46427773',
'AK47347657',
'AK46435888',
'AK46410861',
'AK46411544',
'AK46414057',
'AK46422760',
'AK47253780',
'AK47253820',
'AK46244781',
'AK47307464',
'AK46993434',
            );

            // キャンセル理由の定義
            $reason = '';
            $reasonCode = 8;
            // <-------------------------------------------------------------------------

            $logic = new LogicCancel($this->dbAdapter);

            // 対象データ分ループ
            foreach ($target as $orderId) {
                // $this->logger->info('[' . $orderId . '] Start ');

                // 注文SEQを特定する
                $sql = ' SELECT * FROM T_Order WHERE OrderId = :OrderId ';
                $prm = array(
                    ':OrderId' => $orderId,
                );

                $row = $this->dbAdapter->query($sql)->execute($prm)->current();

                if (!$row) {
                    // 特定できない場合はアラート出力⇒次の行へ
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] OrderId Is Not Found!!');
                    continue;
                }

                // 注文SEQ特定
                $oseq = $row['OrderSeq'];

                // キャンセル申請処理を行う
                try {
                    $logic->applies($oseq, $reason, $reasonCode, 1, false, $userId);
                    $this->logger->info('<CancelRegister> [' . $orderId . '] Complete!! ');
                } catch(OrderCancelException $oce) {
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] Order Is Not Cancel Message = ' . $oce->getMessage());
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] ' . $oce->getTraceAsString());
                }

            }

            // $this->dbAdapter->getDriver()->getConnection()->rollback();
            $this->dbAdapter->getDriver()->getConnection()->commit();

            $exitCode = 0; // 正常終了
$this->logger->info('_data_patch_20201009_1530_CancelRegister.php end');

        } catch( \Exception $e ) {
            try{
                $this->dbAdapter->getDriver()->getConnection()->rollback();
            } catch ( \Exception $err) { }

            // エラーログを出力
            if ( isset($this->logger) ) {
$this->logger->err('<CancelRegister> ' . $e->getMessage());
$this->logger->err('<CancelRegister> ' . $e->getTraceAsString());
            }
        }

        // 終了コードを指定して処理終了
        exit($exitCode);

    }
}

Application::getInstance()->run();
