<?php
chdir(dirname(__DIR__));

// Setup autoloading
require 'init_autoloader.php';

setlocale( LC_ALL, 'ja_JP.UTF-8' );
ini_set( 'default_charset', 'UTF-8' );
mb_internal_encoding( 'UTF-8' );
mb_http_output('UTF-8');
mb_regex_encoding( 'UTF-8' );

ini_set( 'max_execution_time', 0 );


use Coral\Base\Application\BaseApplicationAbstract;
use Coral\Base\BaseLog;
use Zend\Db\Adapter\Adapter;
use Zend\Config\Reader\Ini;
use models\Table\TableUser;
use models\Logic\LogicCancel;
use models\Logic\OrderCancelException;


/**
 * アプリケーションクラスです。
 *
 */
class Application extends BaseApplicationAbstract {
    protected $_application_id = 'tools-CancelRegister-batch';

    /**
     * Application の唯一のインスタンスを取得します。
     *
     * @static
     * @access public
     * @return Application
     */
    public static function getInstance() {
        if( self::$_instance === null ) {
            self::$_instance = new self();
        }

        return self::$_instance;
    }

    /**
     * Application の新しいインスタンスを初期化します。
     *
     * @ignore
     * @access private
     */
    private function __construct() {
        parent::init();
    }

    /**
     * @var Adapter
     */
    public $dbAdapter;

    /**
     * @var BaseLog
     */
    public $logger;


    /**
     * アプリケーションを実行します。
     *
     * @access public
     */
    public function run() {
        $exitCode = 1;

        try {

            // 実行確認
            echo "Run the Cancel batch. Is it OK?(Y/N)";
            $yn = trim(fgets(STDIN));
            if (strtoupper($yn) != 'Y') {
                echo "It has stopped the execution. ";
                exit(0);
            }

            // iniファイルから設定を取得
            $configPath = __DIR__ . '/../module/cbadmin/config/config.ini';

            // データベースアダプタをiniファイルから初期化します
            $data = array();
            if (file_exists($configPath))
            {
                $reader = new Ini();
                $data = $reader->fromFile($configPath);
            }
            $this->dbAdapter = new Adapter($data['database']);

            // ログ設定の読み込み
            $logConfig = $data['log'];
            // 標準ログクラス初期化
            $this->logger = BaseLog::createFromArray( $logConfig );
$this->logger->info('_data_patch_20191111_1700_CancelRegister.php start');

            $globalConfig = include __DIR__ . '/../config/autoload/global.php';
            // 接続時間を設定する
            $rds_session_timezone = $globalConfig['RDS_SESSION_TIMEZONE'];
            if (isset($rds_session_timezone)) {
                $this->dbAdapter->query('SET SESSION time_zone = :time_zone')->execute(array(':time_zone'=>$rds_session_timezone));
            }

            // 設定をシステムプロパティテーブルから読み込み
            $apinfo = $this->getApplicationiInfo($this->dbAdapter, 'cbadmin');
            // iniファイルの内容をマージ
            $data = array_merge($data, $apinfo);

            // ユーザーID取得
            $mdlu = new TableUser($this->dbAdapter);
            $userId = $mdlu->getUserId(TableUser::USERCLASS_SYSTEM, TableUser::SEQ_BATCH_USER);

            $this->dbAdapter->getDriver()->getConnection()->beginTransaction();


            // ------------------------------------------------------------------------->
            // 対象の定義
            $target = array(
                    'AB39804200',
                    'AB39799310',
                    'AB39801220',
                    'AB39801740',
                    'AB39802460',
                    'AB39804751',
                    'AB39689851',
                    'AB39803081',
                    'AB39798302',
                    'AB39803332',
                    'AB39800252',
                    'AB39802362',
                    'AB39804372',
                    'AB39801203',
                    'AB39800603',
                    'AB39798813',
                    'AB39802223',
                    'AB39800623',
                    'AB39801723',
                    'AB39798923',
                    'AB39798353',
                    'AB39798883',
                    'AB39798804',
                    'AB39801834',
                    'AB39803934',
                    'AB39798364',
                    'AB39798574',
                    'AB39798315',
                    'AB39803715',
                    'AB39798335',
                    'AB39799406',
                    'AB39799506',
                    'AB39800316',
                    'AB39798366',
                    'AB39803586',
                    'AB39799507',
                    'AB39802217',
                    'AB39802617',
                    'AB39806297',
                    'AB39798897',
                    'AB39803728',
                    'AB39802068',
                    'AB39798478',
                    'AB39798388',
                    'AB39689888',
                    'AB39689809',
                    'AB39801759',
                    'AB39799369',
                    'AK39781100',
                    'AK39760300',
                    'AK39766300',
                    'AK39762400',
                    'AK39841700',
                    'AK39763800',
                    'AK39775800',
                    'AK39777110',
                    'AK39775210',
                    'AK39778310',
                    'AK39772410',
                    'AK39841810',
                    'AK39312810',
                    'AK39779810',
                    'AK39760020',
                    'AK39774020',
                    'AK39764320',
                    'AK39760520',
                    'AK39758520',
                    'AK39781620',
                    'AK39774620',
                    'AK39765620',
                    'AK39764720',
                    'AK39776130',
                    'AK39762230',
                    'AK39771530',
                    'AK39762730',
                    'AK39764730',
                    'AK39763830',
                    'AK39761540',
                    'AK39757540',
                    'AK39780640',
                    'AK39763740',
                    'AK39777050',
                    'AK39763250',
                    'AK39765450',
                    'AK39757450',
                    'AK39761550',
                    'AK39774650',
                    'AK39765850',
                    'AK39776060',
                    'AK39776160',
                    'AK39775260',
                    'AK39776260',
                    'AK39778260',
                    'AK39760460',
                    'AK39761560',
                    'AK39765560',
                    'AK39841660',
                    'AK39774860',
                    'AK39776860',
                    'AK39776070',
                    'AK39314270',
                    'AK39757370',
                    'AK39762470',
                    'AK39760970',
                    'AK39762970',
                    'AK39776180',
                    'AK39778180',
                    'AK39765280',
                    'AK39765480',
                    'AK39777480',
                    'AK39771680',
                    'AK39770880',
                    'AK39762980',
                    'AK39776980',
                    'AK39760190',
                    'AK39762190',
                    'AK39758190',
                    'AK39765590',
                    'AK39759890',
                    'AK39758990',
                    'AK39760101',
                    'AK39776101',
                    'AK39771301',
                    'AK39773401',
                    'AK39765401',
                    'AK39773601',
                    'AK39760111',
                    'AK39781211',
                    'AK39763211',
                    'AK39757411',
                    'AK39776611',
                    'AK39760021',
                    'AK39761021',
                    'AK39779221',
                    'AK39771321',
                    'AK39759321',
                    'AK39764721',
                    'AK39774721',
                    'AK39759821',
                    'AK39764921',
                    'AK39759231',
                    'AK39763431',
                    'AK39776041',
                    'AK39776141',
                    'AK39771241',
                    'AK39764541',
                    'AK39764641',
                    'AK39760251',
                    'AK39773351',
                    'AK39778651',
                    'AK39775951',
                    'AK39777951',
                    'AK39773061',
                    'AK39758161',
                    'AK39757361',
                    'AK39779761',
                    'AK39760961',
                    'AK39763961',
                    'AK39764961',
                    'AK39782371',
                    'AK39769771',
                    'AK39759081',
                    'AK39302481',
                    'AK39761681',
                    'AK39778781',
                    'AK39778881',
                    'AK39760091',
                    'AK39759491',
                    'AK39764702',
                    'AK39777902',
                    'AK39770912',
                    'AK39757422',
                    'AK39765622',
                    'AK39762722',
                    'AK39778722',
                    'AK39764032',
                    'AK39759132',
                    'AK39762832',
                    'AK39764932',
                    'AK39766242',
                    'AK39764442',
                    'AK39759942',
                    'AK39776052',
                    'AK39761152',
                    'AK39761252',
                    'AK39764352',
                    'AK39766352',
                    'AK39759352',
                    'AK39778452',
                    'AK39770552',
                    'AK39772752',
                    'AK39774852',
                    'AK39779062',
                    'AK39759462',
                    'AK39757562',
                    'AK39765662',
                    'AK39761762',
                    'AK39778862',
                    'AK39763962',
                    'AK39779962',
                    'AK39765172',
                    'AK39776272',
                    'AK39762372',
                    'AK39757572',
                    'AK39782082',
                    'AK39771282',
                    'AK39765482',
                    'AK39776482',
                    'AK39771782',
                    'AK39758782',
                    'AK39774882',
                    'AK39779882',
                    'AK39764982',
                    'AK39760092',
                    'AK39764192',
                    'AK39774292',
                    'AK39770392',
                    'AK39772592',
                    'AK39772692',
                    'AK39765692',
                    'AK39759692',
                    'AK39766103',
                    'AK39776103',
                    'AK39776203',
                    'AK39780303',
                    'AK39757403',
                    'AK39778013',
                    'AK39765213',
                    'AK39310413',
                    'AK39763813',
                    'AK39776123',
                    'AK39770323',
                    'AK39764523',
                    'AK39760723',
                    'AK39775923',
                    'AK39763033',
                    'AK39765133',
                    'AK39759133',
                    'AK40024533',
                    'AK39770733',
                    'AK39763933',
                    'AK39765043',
                    'AK39777043',
                    'AK39759043',
                    'AK39778243',
                    'AK39779343',
                    'AK39773443',
                    'AK39775443',
                    'AK39760643',
                    'AK39761643',
                    'AK39764743',
                    'AK39774843',
                    'AK39758843',
                    'AK39760053',
                    'AK39764853',
                    'AK39774953',
                    'AK39759163',
                    'AK39775363',
                    'AK39314463',
                    'AK39761663',
                    'AK39779763',
                    'AK39761863',
                    'AK39840963',
                    'AK39777963',
                    'AK39766183',
                    'AK39765283',
                    'AK39760683',
                    'AK39762193',
                    'AK39771293',
                    'AK39778293',
                    'AK39759693',
                    'AK39779693',
                    'AK39780893',
                    'AK39771993',
                    'AK39776993',
                    'AK39759104',
                    'AK39759204',
                    'AK39776404',
                    'AK39757404',
                    'AK39764504',
                    'AK39758904',
                    'AK39782014',
                    'AK39761114',
                    'AK39774114',
                    'AK39771414',
                    'AK39758414',
                    'AK39764514',
                    'AK39776514',
                    'AK39769714',
                    'AK39761024',
                    'AK39761324',
                    'AK39763324',
                    'AK39763824',
                    'AK39757824',
                    'AK39760134',
                    'AK39765134',
                    'AK39762234',
                    'AK39776434',
                    'AK39775534',
                    'AK39764634',
                    'AK39759044',
                    'AK39779044',
                    'AK39771244',
                    'AK39764344',
                    'AK39780644',
                    'AK39783644',
                    'AK39765944',
                    'AK39758154',
                    'AK39758454',
                    'AK39765554',
                    'AK39757554',
                    'AK39312854',
                    'AK39764164',
                    'AK39762364',
                    'AK39774364',
                    'AK39760564',
                    'AK39775564',
                    'AK39841764',
                    'AK39765964',
                    'AK39780074',
                    'AK39765074',
                    'AK39777074',
                    'AK39759074',
                    'AK39762174',
                    'AK39763174',
                    'AK39759374',
                    'AK39765474',
                    'AK39769474',
                    'AK39763674',
                    'AK39763874',
                    'AK39764084',
                    'AK39761184',
                    'AK39777184',
                    'AK39783384',
                    'AK39776784',
                    'AK39782294',
                    'AK39765794',
                    'AK39762894',
                    'AK39778994',
                    'AK39765305',
                    'AK39761505',
                    'AK39760905',
                    'AK39765905',
                    'AK39759115',
                    'AK39760415',
                    'AK39778415',
                    'AK39758915',
                    'AK39760025',
                    'AK39765025',
                    'AK39760125',
                    'AK39782125',
                    'AK39784125',
                    'AK39757925',
                    'AK39761035',
                    'AK39775335',
                    'AK39778635',
                    'AK39776735',
                    'AK39761835',
                    'AK39762935',
                    'AK39776145',
                    'AK39760545',
                    'AK39761545',
                    'AK39765545',
                    'AK39761255',
                    'AK39758255',
                    'AK39759355',
                    'AK39757455',
                    'AK39760555',
                    'AK39765555',
                    'AK39765655',
                    'AK39776065',
                    'AK39764165',
                    'AK39765365',
                    'AK39761465',
                    'AK39759865',
                    'AK39770965',
                    'AK39764175',
                    'AK39766275',
                    'AK39771475',
                    'AK39771975',
                    'AK39764085',
                    'AK39766085',
                    'AK39773585',
                    'AK39776585',
                    'AK39769585',
                    'AK39775785',
                    'AK39763095',
                    'AK39763195',
                    'AK39783295',
                    'AK39780795',
                    'AK39775795',
                    'AK39759406',
                    'AK39760606',
                    'AK39765606',
                    'AK39765706',
                    'AK39783806',
                    'AK39772216',
                    'AK39770316',
                    'AK39841816',
                    'AK39766326',
                    'AK39778626',
                    'AK39758826',
                    'AK39764926',
                    'AK39766036',
                    'AK39777236',
                    'AK39758736',
                    'AK39772046',
                    'AK39776046',
                    'AK39759046',
                    'AK39306146',
                    'AK39766246',
                    'AK39777246',
                    'AK39764346',
                    'AK39775346',
                    'AK39763746',
                    'AK39775746',
                    'AK39774056',
                    'AK39775156',
                    'AK39772456',
                    'AK39780066',
                    'AK39765266',
                    'AK39776366',
                    'AK39777076',
                    'AK39761276',
                    'AK39759276',
                    'AK39763376',
                    'AK39764576',
                    'AK39776576',
                    'AK39762676',
                    'AK39774876',
                    'AK39769876',
                    'AK39761976',
                    'AK39775976',
                    'AK39763086',
                    'AK39776186',
                    'AK39777186',
                    'AK39763386',
                    'AK39760686',
                    'AK39774686',
                    'AK39777786',
                    'AK39761886',
                    'AK39780986',
                    'AK39761096',
                    'AK39776196',
                    'AK39763296',
                    'AK39760396',
                    'AK39770796',
                    'AK39765796',
                    'AK39765207',
                    'AK39776507',
                    'AK39775707',
                    'AK39779017',
                    'AK39771117',
                    'AK39763317',
                    'AK39763417',
                    'AK39757417',
                    'AK39764717',
                    'AK39757817',
                    'AK39776127',
                    'AK39776227',
                    'AK39759227',
                    'AK39763527',
                    'AK39763627',
                    'AK39776727',
                    'AK39775337',
                    'AK39775437',
                    'AK39779837',
                    'AK39775937',
                    'AK39784047',
                    'AK39777047',
                    'AK39763147',
                    'AK39775147',
                    'AK39771247',
                    'AK39763247',
                    'AK39759347',
                    'AK39763647',
                    'AK39758847',
                    'AK39762057',
                    'AK39777057',
                    'AK39772157',
                    'AK39770257',
                    'AK39780957',
                    'AK39758167',
                    'AK39764267',
                    'AK39772177',
                    'AK39763177',
                    'AK39765277',
                    'AK39766377',
                    'AK39774877',
                    'AK39776087',
                    'AK39758187',
                    'AK39762887',
                    'AK39779887',
                    'AK39759987',
                    'AK39766197',
                    'AK39759397',
                    'AK39760697',
                    'AK39775008',
                    'AK39765208',
                    'AK39773308',
                    'AK39763408',
                    'AK39757408',
                    'AK39774118',
                    'AK39764318',
                    'AK39757318',
                    'AK39759418',
                    'AK39772518',
                    'AK39771618',
                    'AK39782618',
                    'AK39781718',
                    'AK39841818',
                    'AK39760918',
                    'AK39766028',
                    'AK39777228',
                    'AK39776328',
                    'AK39780428',
                    'AK39764528',
                    'AK39775528',
                    'AK39779528',
                    'AK39773628',
                    'AK39769628',
                    'AK39763928',
                    'AK39775928',
                    'AK39759038',
                    'AK39776238',
                    'AK39777238',
                    'AK39765438',
                    'AK39841738',
                    'AK39772738',
                    'AK39759738',
                    'AK39769838',
                    'AK39766048',
                    'AK39759148',
                    'AK39759248',
                    'AK39774348',
                    'AK39757348',
                    'AK39764648',
                    'AK39776158',
                    'AK39766258',
                    'AK39770358',
                    'AK40024458',
                    'AK39760558',
                    'AK39764758',
                    'AK39763068',
                    'AK39773968',
                    'AK39757968',
                    'AK39760378',
                    'AK39760478',
                    'AK39760678',
                    'AK39770778',
                    'AK39762778',
                    'AK39773778',
                    'AK39758778',
                    'AK39761878',
                    'AK39765388',
                    'AK39759388',
                    'AK39762488',
                    'AK39765888',
                    'AK38916888',
                    'AK39759888',
                    'AK39763298',
                    'AK39761798',
                    'AK39776109',
                    'AK39776209',
                    'AK39779609',
                    'AK39760709',
                    'AK39774809',
                    'AK39771019',
                    'AK39775619',
                    'AK39758129',
                    'AK39771229',
                    'AK39762529',
                    'AK39773929',
                    'AK39774929',
                    'AK39775139',
                    'AK39777239',
                    'AK39759339',
                    'AK39763439',
                    'AK39774539',
                    'AK39765739',
                    'AK39762939',
                    'AK39765939',
                    'AK39762049',
                    'AK39758049',
                    'AK39759149',
                    'AK39770449',
                    'AK39772649',
                    'AK39772749',
                    'AK39763749',
                    'AK39758749',
                    'AK39770849',
                    'AK39769949',
                    'AK39759059',
                    'AK39765459',
                    'AK39761859',
                    'AK39770169',
                    'AK39763269',
                    'AK39770369',
                    'AK39765369',
                    'AK39760469',
                    'AK39773569',
                    'AK39760669',
                    'AK39757669',
                    'AK39759669',
                    'AK39759279',
                    'AK39765779',
                    'AK39761879',
                    'AK39759879',
                    'AK39775979',
                    'AK39776979',
                    'AK39776089',
                    'AK39764189',
                    'AK39760589',
                    'AK39775789',
                    'AK39769789',
                    'AK39760099',
                    'AK39762099',
                    'AK39760399',
                    'AK39764499',
                    'AK39765599',
                    'AK40687452',
                    'AK39782999',
                    'AK39542530',
                    'AK39508750',
                    'AK39765570',
                    'AK39582080',
                    'AK39929351',
                    'AK39564632',
                    'AK39791452',
                    'AK39633762',
                    'AK40028372',
                    'AK39680923',
                    'AK39542533',
                    'AK39844234',
                    'AK39747634',
                    'AK39899464',
                    'AK39715374',
                    'AK39993974',
                    'AK39582084',
                    'AK39618825',
                    'AK39680925',
                    'AK39872485',
                    'AK39564636',
                    'AK39949196',
                    'AK39747627',
                    'AK39715377',
                    'AK39633758',
                    'AK39536319',
                    'AK39747629',
                    'AK39929339',
                    'AK39508749',
                    'AK39474799',
                    'AK39330320',
                    'AK39220520',
                    'AK39306620',
                    'AK39353331',
                    'AK39539561',
                    'AK39532491',
                    'AK39203832',
                    'AK39473262',
                    'AK39520423',
                    'AK39324063',
                    'AK39396163',
                    'AK39194873',
                    'AK39181114',
                    'AK39167265',
                    'AK39491765',
                    'AK39245895',
                    'AK39203406',
                    'AK39191726',
                    'AK39194876',
                    'AK39161686',
                    'AK39310496',
                    'AK39177996',
                    'AK39458107',
                    'AK39189027',
                    'AK39466427',
                    'AK39177837',
                    'AK39197387',
                    'AK39322548',
                    'AK39321558',
                    'AK39212388',
                    'AK39182909',
                    'AK39418419',
                    'AK39203539',
                    'AK39561849',
                    'AK39359169',
                    'AK39209769',
                    'AK39210099',

            );

            // キャンセル理由の定義
            $reason = '';
            $reasonCode = 8;
            // <-------------------------------------------------------------------------

            $logic = new LogicCancel($this->dbAdapter);

            // 対象データ分ループ
            foreach ($target as $orderId) {
                // $this->logger->info('[' . $orderId . '] Start ');

                // 注文SEQを特定する
                $sql = ' SELECT * FROM T_Order WHERE OrderId = :OrderId ';
                $prm = array(
                    ':OrderId' => $orderId,
                );

                $row = $this->dbAdapter->query($sql)->execute($prm)->current();

                if (!$row) {
                    // 特定できない場合はアラート出力⇒次の行へ
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] OrderId Is Not Found!!');
                    continue;
                }

                // 注文SEQ特定
                $oseq = $row['OrderSeq'];

                // キャンセル申請処理を行う
                try {
                    $logic->applies($oseq, $reason, $reasonCode, 1, false, $userId);
                    $this->logger->info('<CancelRegister> [' . $orderId . '] Complete!! ');
                } catch(OrderCancelException $oce) {
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] Order Is Not Cancel Message = ' . $oce->getMessage());
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] ' . $oce->getTraceAsString());
                }

            }

            // $this->dbAdapter->getDriver()->getConnection()->rollback();
            $this->dbAdapter->getDriver()->getConnection()->commit();

            $exitCode = 0; // 正常終了
$this->logger->info('_data_patch_20191111_1700_CancelRegister.php end');

        } catch( \Exception $e ) {
            try{
                $this->dbAdapter->getDriver()->getConnection()->rollback();
            } catch ( \Exception $err) { }

            // エラーログを出力
            if ( isset($this->logger) ) {
$this->logger->err('<CancelRegister> ' . $e->getMessage());
$this->logger->err('<CancelRegister> ' . $e->getTraceAsString());
            }
        }

        // 終了コードを指定して処理終了
        exit($exitCode);

    }
}

Application::getInstance()->run();
