<?php
chdir(dirname(__DIR__));

// Setup autoloading
require 'init_autoloader.php';

setlocale( LC_ALL, 'ja_JP.UTF-8' );
ini_set( 'default_charset', 'UTF-8' );
mb_internal_encoding( 'UTF-8' );
mb_http_output('UTF-8');
mb_regex_encoding( 'UTF-8' );

ini_set( 'max_execution_time', 0 );


use Coral\Base\Application\BaseApplicationAbstract;
use Coral\Base\BaseLog;
use Zend\Db\Adapter\Adapter;
use Zend\Config\Reader\Ini;
use models\Table\TableUser;
use models\Logic\LogicCancel;
use models\Logic\OrderCancelException;


/**
 * アプリケーションクラスです。
 *
 */
class Application extends BaseApplicationAbstract {
    protected $_application_id = 'tools-CancelRegister-batch';

    /**
     * Application の唯一のインスタンスを取得します。
     *
     * @static
     * @access public
     * @return Application
     */
    public static function getInstance() {
        if( self::$_instance === null ) {
            self::$_instance = new self();
        }

        return self::$_instance;
    }

    /**
     * Application の新しいインスタンスを初期化します。
     *
     * @ignore
     * @access private
     */
    private function __construct() {
        parent::init();
    }

    /**
     * @var Adapter
     */
    public $dbAdapter;

    /**
     * @var BaseLog
     */
    public $logger;


    /**
     * アプリケーションを実行します。
     *
     * @access public
     */
    public function run() {
        $exitCode = 1;

        try {

            // 実行確認
            echo "Run the Cancel batch. Is it OK?(Y/N)";
            $yn = trim(fgets(STDIN));
            if (strtoupper($yn) != 'Y') {
                echo "It has stopped the execution. ";
                exit(0);
            }

            // iniファイルから設定を取得
            $configPath = __DIR__ . '/../module/cbadmin/config/config.ini';

            // データベースアダプタをiniファイルから初期化します
            $data = array();
            if (file_exists($configPath))
            {
                $reader = new Ini();
                $data = $reader->fromFile($configPath);
            }
            $this->dbAdapter = new Adapter($data['database']);

            // ログ設定の読み込み
            $logConfig = $data['log'];
            // 標準ログクラス初期化
            $this->logger = BaseLog::createFromArray( $logConfig );
$this->logger->info('_data_patch_20200310_1600_CancelRegister.php start');

            $globalConfig = include __DIR__ . '/../config/autoload/global.php';
            // 接続時間を設定する
            $rds_session_timezone = $globalConfig['RDS_SESSION_TIMEZONE'];
            if (isset($rds_session_timezone)) {
                $this->dbAdapter->query('SET SESSION time_zone = :time_zone')->execute(array(':time_zone'=>$rds_session_timezone));
            }

            // 設定をシステムプロパティテーブルから読み込み
            $apinfo = $this->getApplicationiInfo($this->dbAdapter, 'cbadmin');
            // iniファイルの内容をマージ
            $data = array_merge($data, $apinfo);

            // ユーザーID取得
            $mdlu = new TableUser($this->dbAdapter);
            $userId = $mdlu->getUserId(TableUser::USERCLASS_SYSTEM, TableUser::SEQ_BATCH_USER);

            $this->dbAdapter->getDriver()->getConnection()->beginTransaction();


            // ------------------------------------------------------------------------->
            // 対象の定義
            $target = array(
'AK42473100',
'AK42465100',
'AK42395100',
'AK42473200',
'AK42674400',
'AK42416400',
'AK42416600',
'AK42780800',
'AK42730110',
'AK42586510',
'AK42506610',
'AK42588610',
'AK42364710',
'AK42365520',
'AK42387130',
'AK42416230',
'AK42506730',
'AK42730440',
'AK42365540',
'AK42476640',
'AK42586450',
'AK42683460',
'AK42681560',
'AK42506960',
'AK42389070',
'AK42647270',
'AK42365570',
'AK42416280',
'AK42469280',
'AK42558380',
'AK42688380',
'AK42364580',
'AK42480090',
'AK42647190',
'AK42416290',
'AK42506690',
'AK42485790',
'AK42416790',
'AK42464990',
'AK42506501',
'AK42364601',
'AK42394601',
'AK42416511',
'AK42446811',
'AK42399911',
'AK42513021',
'AK42825021',
'AK42637221',
'AK42416421',
'AK42563521',
'AK42503031',
'AK42824531',
'AK42364531',
'AK42364631',
'AK42506631',
'AK42485831',
'AK42417041',
'AK42473341',
'AK42416341',
'AK42473441',
'AK42365441',
'AK42586441',
'AK42416251',
'AK42364551',
'AK42384751',
'AK42385851',
'AK42416461',
'AK42416661',
'AK42692861',
'AK42575481',
'AK42506681',
'AK42364391',
'AK42365491',
'AK42416602',
'AK42780802',
'AK42561802',
'AK42391802',
'AK42485802',
'AK42918012',
'AK42545112',
'AK42818212',
'AK42650512',
'AK42479512',
'AK42398912',
'AK42692122',
'AK42730422',
'AK42364422',
'AK42363722',
'AK42391822',
'AK42707032',
'AK42364832',
'AK42713142',
'AK42674342',
'AK42416942',
'AK42473252',
'AK42582852',
'AK42687852',
'AK42730062',
'AK42473262',
'AK42674362',
'AK42824562',
'AK42364962',
'AK42364372',
'AK42365472',
'AK42635572',
'AK42692872',
'AK42824282',
'AK42416482',
'AK42673582',
'AK42506582',
'AK42557492',
'AK42824592',
'AK42485792',
'AK42712892',
'AK42465003',
'AK42473203',
'AK42506503',
'AK42509703',
'AK42391803',
'AK42364803',
'AK42365013',
'AK42556113',
'AK42364413',
'AK42542713',
'AK42485813',
'AK42396423',
'AK42365523',
'AK42501823',
'AK42365233',
'AK42485833',
'AK42405043',
'AK42473543',
'AK42365253',
'AK42365553',
'AK42465073',
'AK42371473',
'AK42506573',
'AK42485873',
'AK42543083',
'AK42581283',
'AK42586483',
'AK42506683',
'AK42692893',
'AK42416993',
'AK42582004',
'AK42394004',
'AK42365004',
'AK42365304',
'AK42650504',
'AK42416504',
'AK42726504',
'AK42469504',
'AK42505804',
'AK42485804',
'AK42364514',
'AK42700714',
'AK42365324',
'AK42753334',
'AK42365434',
'AK42473244',
'AK42416244',
'AK42365544',
'AK42577644',
'AK42464944',
'AK42417064',
'AK42416264',
'AK42365464',
'AK42410864',
'AK42364374',
'AK42485774',
'AK42464974',
'AK42730384',
'AK42364384',
'AK42685394',
'AK42586505',
'AK42646605',
'AK42678905',
'AK42365225',
'AK42506625',
'AK42541925',
'AK42769035',
'AK42365335',
'AK42473435',
'AK42416435',
'AK42711735',
'AK42400935',
'AK42380935',
'AK42398935',
'AK42365045',
'AK42364445',
'AK42506645',
'AK42416255',
'AK42442755',
'AK42416955',
'AK42621165',
'AK42473165',
'AK42364565',
'AK42416665',
'AK42579475',
'AK42506575',
'AK42543775',
'AK42801975',
'AK42824975',
'AK42364975',
'AK42365185',
'AK42473285',
'AK42689095',
'AK42694295',
'AK42539295',
'AK42640595',
'AK42485795',
'AK42416795',
'AK42416306',
'AK42364406',
'AK42364506',
'AK42365506',
'AK42506506',
'AK42407506',
'AK42506606',
'AK42748606',
'AK42467016',
'AK42715116',
'AK42730416',
'AK42365416',
'AK42536416',
'AK42586416',
'AK42546816',
'AK42476816',
'AK42473136',
'AK42416336',
'AK42546536',
'AK42649536',
'AK42465046',
'AK42365246',
'AK42676246',
'AK42674346',
'AK42364546',
'AK42365546',
'AK42556746',
'AK42824156',
'AK42643356',
'AK42455456',
'AK42506556',
'AK42416656',
'AK42485756',
'AK42416766',
'AK42404076',
'AK42473476',
'AK42464976',
'AK42416586',
'AK42485786',
'AK42687786',
'AK42730396',
'AK42643496',
'AK42650507',
'AK42407507',
'AK42722907',
'AK42465017',
'AK42648017',
'AK42416217',
'AK42543317',
'AK42364417',
'AK42364517',
'AK42479617',
'AK42416717',
'AK42474127',
'AK42749327',
'AK42364427',
'AK42416727',
'AK42365237',
'AK42416437',
'AK42751047',
'AK42473247',
'AK42506547',
'AK42577647',
'AK42464947',
'AK42365467',
'AK42485767',
'AK42479767',
'AK42390967',
'AK42464967',
'AK42473177',
'AK42761377',
'AK42705477',
'AK42518477',
'AK42506577',
'AK42581677',
'AK42562877',
'AK42485877',
'AK42567877',
'AK42465087',
'AK42688087',
'AK42506487',
'AK42399587',
'AK42493397',
'AK42569308',
'AK42364508',
'AK42506708',
'AK42365028',
'AK42657028',
'AK42365528',
'AK42364438',
'AK42546438',
'AK42550738',
'AK42364738',
'AK42364838',
'AK42531938',
'AK42364348',
'AK42651548',
'AK42563548',
'AK42416948',
'AK42364158',
'AK42543958',
'AK42464958',
'AK42562068',
'AK42506668',
'AK42364968',
'AK42372278',
'AK42365478',
'AK42416478',
'AK42365578',
'AK42506578',
'AK42400778',
'AK42485778',
'AK42464988',
'AK42473098',
'AK42365298',
'AK42650498',
'AK42473498',
'AK42585498',
'AK42780798',
'AK42485798',
'AK42582898',
'AK42464998',
'AK42473109',
'AK42558209',
'AK42365309',
'AK42730409',
'AK42544609',
'AK42647709',
'AK42465119',
'AK42365419',
'AK42477419',
'AK42707329',
'AK42506529',
'AK42506629',
'AK42365039',
'AK42485239',
'AK42364539',
'AK42481639',
'AK42365349',
'AK42364449',
'AK42585449',
'AK42416549',
'AK42681849',
'AK42506559',
'AK42416759',
'AK42546959',
'AK42364469',
'AK42416669',
'AK42473769',
'AK42365189',
'AK42365589',
'AK42537789',
'AK42365199',
'AK42415399',
'AK42365499',
'AK42364599',
'AK42485899',
'AK42639899',
'AK42823900',
'AK42753210',
'AK42416410',
'AK42970810',
'AK42861720',
'AK43064030',
'AK42802130',
'AK42824130',
'AK42918130',
'AK42753330',
'AK42970730',
'AK42364730',
'AK42892040',
'AK42802140',
'AK42753240',
'AK42546340',
'AK42729650',
'AK43088950',
'AK42729950',
'AK42365060',
'AK42730260',
'AK42823960',
'AK42464960',
'AK42416270',
'AK42861570',
'AK42729670',
'AK42823970',
'AK42918080',
'AK42824380',
'AK42729580',
'AK42823980',
'AK43129190',
'AK42824290',
'AK42730001',
'AK43089001',
'AK42730101',
'AK42824101',
'AK42785801',
'AK43109411',
'AK42861511',
'AK42823711',
'AK42892021',
'AK42940221',
'AK42824321',
'AK42824421',
'AK42416521',
'AK42824031',
'AK42780731',
'AK42918041',
'AK43129141',
'AK42940241',
'AK42506641',
'AK42729641',
'AK42787841',
'AK43088941',
'AK42824051',
'AK42825051',
'AK42940151',
'AK42824151',
'AK43020351',
'AK42823751',
'AK42825061',
'AK43020361',
'AK42823761',
'AK42917961',
'AK42892071',
'AK42753071',
'AK42730171',
'AK42753171',
'AK42823871',
'AK42940181',
'AK42730281',
'AK42996781',
'AK42823881',
'AK42485881',
'AK42464981',
'AK42753191',
'AK42824391',
'AK42917991',
'AK42970802',
'AK42784902',
'AK42489422',
'AK42861622',
'AK42824622',
'AK42802032',
'AK42417032',
'AK42730332',
'AK42824152',
'AK43129152',
'AK42730252',
'AK42936252',
'AK42823852',
'AK42940162',
'AK42892162',
'AK42824162',
'AK42824262',
'AK42365362',
'AK42506562',
'AK42729662',
'AK42729862',
'AK42824172',
'AK42753372',
'AK42473472',
'AK42729672',
'AK42730082',
'AK42917982',
'AK42609982',
'AK42730092',
'AK42753292',
'AK43020392',
'AK42970792',
'AK42753203',
'AK42843303',
'AK42824403',
'AK42970803',
'AK42730213',
'AK42824313',
'AK42849513',
'AK42364613',
'AK42940123',
'AK42473533',
'AK42861633',
'AK42753343',
'AK42365543',
'AK42506643',
'AK42824053',
'AK42940153',
'AK42729853',
'AK43020363',
'AK42841173',
'AK42802173',
'AK42753273',
'AK42824373',
'AK42970773',
'AK42861773',
'AK42824183',
'AK42785183',
'AK43129183',
'AK42918093',
'AK42364893',
'AK42824204',
'AK42861614',
'AK42970814',
'AK42730224',
'AK42823824',
'AK42892134',
'AK42940234',
'AK42780734',
'AK42824734',
'AK43019044',
'AK42780744',
'AK42824054',
'AK42416454',
'AK42939554',
'AK42824064',
'AK43197064',
'AK42753364',
'AK42674364',
'AK42861564',
'AK42824074',
'AK42730174',
'AK42940174',
'AK43129174',
'AK42365574',
'AK42823974',
'AK43088974',
'AK42729974',
'AK42824184',
'AK42729684',
'AK42801984',
'AK42917984',
'AK43020394',
'AK42824005',
'AK42824305',
'AK42822605',
'AK42365605',
'AK43064015',
'AK42785025',
'AK42824425',
'AK42970825',
'AK42802035',
'AK42940235',
'AK43088945',
'AK42824055',
'AK42825055',
'AK42465055',
'AK43020355',
'AK42730355',
'AK42465065',
'AK43020365',
'AK42824665',
'AK42970765',
'AK42473275',
'AK42824575',
'AK42891975',
'AK42918085',
'AK42753285',
'AK42824685',
'AK43006685',
'AK42729885',
'AK43088985',
'AK42730295',
'AK42824395',
'AK43064006',
'AK42753206',
'AK42416606',
'AK42780706',
'AK42692906',
'AK42824116',
'AK42753316',
'AK42824316',
'AK42824026',
'AK42940126',
'AK42850226',
'AK42824526',
'AK42729626',
'AK42812926',
'AK42861736',
'AK42940246',
'AK42824056',
'AK42802066',
'AK42918066',
'AK42824366',
'AK42802076',
'AK42843076',
'AK42918076',
'AK42753276',
'AK42990476',
'AK43245476',
'AK42861776',
'AK42890486',
'AK42729986',
'AK42802096',
'AK42861696',
'AK43088996',
'AK42753307',
'AK42861507',
'AK42892117',
'AK42586417',
'AK43028517',
'AK42824617',
'AK42970817',
'AK42823817',
'AK42801917',
'AK42802027',
'AK42861527',
'AK42892037',
'AK42730137',
'AK42824137',
'AK43129137',
'AK42824537',
'AK42861637',
'AK42824047',
'AK42730247',
'AK42753247',
'AK42749347',
'AK42824057',
'AK42364357',
'AK42823757',
'AK42730067',
'AK43129167',
'AK42891867',
'AK42824077',
'AK42940177',
'AK42730277',
'AK42681877',
'AK42824087',
'AK42730187',
'AK42999287',
'AK42823887',
'AK42823987',
'AK42753297',
'AK42934897',
'AK42918008',
'AK42940208',
'AK42824408',
'AK42861608',
'AK42918118',
'AK42824028',
'AK42422428',
'AK42824428',
'AK42823728',
'AK42970828',
'AK42730038',
'AK42892138',
'AK42730238',
'AK42823838',
'AK42729838',
'AK42824058',
'AK42861558',
'AK42824558',
'AK42729558',
'AK42861758',
'AK43088958',
'AK42824168',
'AK42674368',
'AK42824568',
'AK43020378',
'AK43245478',
'AK42970678',
'AK42506678',
'AK42823878',
'AK42970688',
'AK42824398',
'AK42981598',
'AK42824309',
'AK42784409',
'AK42979509',
'AK42801909',
'AK43088909',
'AK42940219',
'AK42709219',
'AK42849319',
'AK43109419',
'AK42861519',
'AK42825029',
'AK42780729',
'AK42802039',
'AK42824039',
'AK42918039',
'AK42938539',
'AK42780739',
'AK42445839',
'AK43088939',
'AK42730149',
'AK42908149',
'AK43129149',
'AK42824349',
'AK42861549',
'AK42823949',
'AK42940159',
'AK42730359',
'AK42917959',
'AK42824069',
'AK42802169',
'AK42801969',
'AK42825079',
'AK42824479',
'AK42824679',
'AK42917979',
'AK43020389',
'AK42365389',
'AK43242889',
'AK42891989',
'AK43088989',
'AK43000199',
'AK43020399',
'AK42952999',
'AK42005740',
'AK42090860',
'AK42319070',
'AK41965380',
'AK42061090',
'AK42061721',
'AK42319061',
'AK42037071',
'AK42222602',
'AK42359122',
'AK42043032',
'AK41929152',
'AK42359282',
'AK41921933',
'AK41999043',
'AK42203553',
'AK41929663',
'AK42075963',
'AK42109683',
'AK42041214',
'AK42358914',
'AK41922264',
'AK41971464',
'AK42253205',
'AK42090545',
'AK42216945',
'AK42089885',
'AK41934306',
'AK42285516',
'AK42039126',
'AK42003766',
'AK42076007',
'AK42079887',
'AK41998208',
'AK41920828',
'AK42358928',
'AK41944558',
'AK42199088',
'AK42138888',
'AK42076149',
'AK43100251',
'AK43636142',
'AK42053459',
            );

            // キャンセル理由の定義
            $reason = '';
            $reasonCode = 8;
            // <-------------------------------------------------------------------------

            $logic = new LogicCancel($this->dbAdapter);

            // 対象データ分ループ
            foreach ($target as $orderId) {
                // $this->logger->info('[' . $orderId . '] Start ');

                // 注文SEQを特定する
                $sql = ' SELECT * FROM T_Order WHERE OrderId = :OrderId ';
                $prm = array(
                    ':OrderId' => $orderId,
                );

                $row = $this->dbAdapter->query($sql)->execute($prm)->current();

                if (!$row) {
                    // 特定できない場合はアラート出力⇒次の行へ
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] OrderId Is Not Found!!');
                    continue;
                }

                // 注文SEQ特定
                $oseq = $row['OrderSeq'];

                // キャンセル申請処理を行う
                try {
                    $logic->applies($oseq, $reason, $reasonCode, 1, false, $userId);
                    $this->logger->info('<CancelRegister> [' . $orderId . '] Complete!! ');
                } catch(OrderCancelException $oce) {
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] Order Is Not Cancel Message = ' . $oce->getMessage());
                    $this->logger->warn('<CancelRegister> [' . $orderId . '] ' . $oce->getTraceAsString());
                }

            }

            // $this->dbAdapter->getDriver()->getConnection()->rollback();
            $this->dbAdapter->getDriver()->getConnection()->commit();

            $exitCode = 0; // 正常終了
$this->logger->info('_data_patch_20200310_1600_CancelRegister.php end');

        } catch( \Exception $e ) {
            try{
                $this->dbAdapter->getDriver()->getConnection()->rollback();
            } catch ( \Exception $err) { }

            // エラーログを出力
            if ( isset($this->logger) ) {
$this->logger->err('<CancelRegister> ' . $e->getMessage());
$this->logger->err('<CancelRegister> ' . $e->getTraceAsString());
            }
        }

        // 終了コードを指定して処理終了
        exit($exitCode);

    }
}

Application::getInstance()->run();
