/* ドロップダウンバーに追加 */
INSERT INTO M_CodeManagement VALUES(203,'マイページ年末年始文言追加',NULL,'仮',0,NULL,0,NULL,0,NULL,NOW(),1,NOW(),1,1);
/* フィールド追加 無効の状態で追加される*/
INSERT INTO M_Code VALUES(203,1,'注文マイページ',NULL,NULL,NULL,'後払いドットコムのご利用者様<br><br> 年末年始の営業のご案内: 休業期間 ：  令和元 年 12 月 28 日（土）～ 令和2 年 1 月 6 日（月）<br>※ 年始は 1月 6日（月）より、通常営業いたします。',0,NOW(),1,NOW(),1,0);
INSERT INTO M_Code VALUES(203,2,'顧客マイページ',NULL,NULL,NULL,'後払いドットコムのご利用者様<br><br> 年末年始の営業のご案内: 休業期間 ：  令和元 年 12 月 28 日（土）～ 令和2 年 1 月 6 日（月）<br>※ 年始は 1月 6日（月）より、通常営業いたします。',0,NOW(),1,NOW(),1,0);